A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [1]:
import pandas as pd

In [4]:
lst = ['Aryan','wala','123','binal']

pd.DataFrame(lst)

       0
0  Aryan
1   wala
2    123
3  binal

### dct = {'Aryan':1,'wala':2,'123':3,'binal':4} 
By using dictonary the key will become the name of the column
Here we are using only 1 value for every key therefore it will generate error

In [8]:
dct = {
    'Name' : ['Aryan','wala','123','binal'],
    'Value': [1,2,3,4]
}

pd.DataFrame(dct)

    Name  Value
0  Aryan      1
1   wala      2
2    123      3
3  binal      4

All the arryas in a dict must be of same length for it to convert into dataframe

In [2]:
data = {
    'Name' : ['Aryan','wala','abcd','binal'],
    'Age': [21,12,43,54],
    'Marks':[100,200,10,20]
}
pd.DataFrame(data)

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

### Slicing the dataframe
the loc() and iloc() are used for slicing

In [18]:
data = {
    'Name' : ['Aryan','wala','abcd','binal'],
    'Age': [21,12,43,54],
    'Marks':[100,200,10,20]
}
df = pd.DataFrame(data)

print(df[['Name','Marks']])

    Name  Marks
0  Aryan    100
1   wala    200
2   abcd     10
3  binal     20

#### loc()
slicing using index value\name

In [22]:
print(df)

df.loc[1:2]

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

   Name  Age  Marks
1  wala   12    200
2  abcd   43     10

In [27]:
df.loc[::-1]

    Name  Age  Marks
3  binal   54     20
2   abcd   43     10
1   wala   12    200
0  Aryan   21    100

In [28]:
df.loc[0:3 , 'Name':'Age']

    Name  Age
0  Aryan   21
1   wala   12
2   abcd   43
3  binal   54

In [30]:
df.loc[0:3 , 'Age':'Name']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

#### iloc()
Slicing just like string

In [31]:
df

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

In [41]:
df.iloc[ : , : ]

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

In [42]:
df.iloc[1:3,0:3] #[row,col]

   Name  Age  Marks
1  wala   12    200
2  abcd   43     10

#### Slicing using conditions

In [43]:
df

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

In [48]:
df['Age'] > 20

0     True
1    False
2     True
3     True
Name: Age, dtype: bool

In [49]:
df[df['Age'] > 20]

    Name  Age  Marks
0  Aryan   21    100
2   abcd   43     10
3  binal   54     20

In [52]:
df.loc[df['Age'] > 20 , ['Name','Age']]

    Name  Age
0  Aryan   21
2   abcd   43
3  binal   54

### Adding Column

In [53]:
df

    Name  Age  Marks
0  Aryan   21    100
1   wala   12    200
2   abcd   43     10
3  binal   54     20

In [55]:
lst = [1,2,3,4] #instead of list we can also add series
df['Index'] = lst
df

    Name  Age  Marks  Index
0  Aryan   21    100      1
1   wala   12    200      2
2   abcd   43     10      3
3  binal   54     20      4

In [57]:
df['Age+10'] = df['Age'] + 10
df

    Name  Age  Marks  Index  Age+10
0  Aryan   21    100      1      31
1   wala   12    200      2      22
2   abcd   43     10      3      53
3  binal   54     20      4      64

### Deletion of Column

In [58]:
df

    Name  Age  Marks  Index  Age+10
0  Aryan   21    100      1      31
1   wala   12    200      2      22
2   abcd   43     10      3      53
3  binal   54     20      4      64

In [60]:
df.pop('Index')

0    1
1    2
2    3
3    4
Name: Index, dtype: int64

In [61]:
df

    Name  Age  Marks  Age+10
0  Aryan   21    100      31
1   wala   12    200      22
2   abcd   43     10      53
3  binal   54     20      64

### Mathemetical operations

In [62]:
df

    Name  Age  Marks  Age+10
0  Aryan   21    100      31
1   wala   12    200      22
2   abcd   43     10      53
3  binal   54     20      64

In [63]:
df.min()

Name      Aryan
Age          12
Marks        10
Age+10       22
dtype: object

In [64]:
df.max()

Name      wala
Age         54
Marks      200
Age+10      64
dtype: object

In [66]:
df['Age'].var()

375.0

In [67]:
df['Age'].std()

19.364916731037084

In [68]:
df.sum()

Name      Aryanwalaabcdbinal
Age                      130
Marks                    330
Age+10                   170
dtype: object

In [70]:
df['Age'].mean()

32.5

In [72]:
df['Age'].median()

32.0

In [73]:
df['Age'].mode()

0    12
1    21
2    43
3    54
Name: Age, dtype: int64